---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures
source: html/f189df2b-5306-d25e-78cd-c056d192b8a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures

Failures about ElementTypeFailures.

## Syntax (C#)
```csharp
public static class ElementTypeFailures
```